# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import random

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp=pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [3]:
# your code here
temp.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [8]:
"""
City and State are strings and temperature is float
"""

'\nCity and State are strings and temperature is float\n'

#### Select the rows where state is New York.

In [10]:
# your code here
temp[temp["State"]=="New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [11]:
# your code here
temp[temp["State"]=="New York"]["Temperature"].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [15]:
# your code here
temp[temp["Temperature"]>15]["State"]

0       New York
3    Connecticut
5     New Jersey
6     New Jersey
Name: State, dtype: object

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [16]:
# your code here
temp[temp["Temperature"]>15]["City"]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [17]:
# your code here
temp[(temp["Temperature"]>15)&(temp["Temperature"]<20)]["City"]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [18]:
# your code here
temp.groupby("State").agg({"Temperature":["mean","std"]})

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [21]:
# your code here
employees=pd.read_csv("Employee.csv")
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [23]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [25]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [26]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [27]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [30]:
# your code here
employees[employees["Salary"]==employees["Salary"].max()]["Name"]

6    Carlos
8       Ana
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [31]:
# your code here
employees[employees["Name"]=="David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [32]:
# your code here
employees[employees["Name"]=="David"]["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [33]:
# your code here
employees[employees["Title"]=="associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [34]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [35]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [36]:
# your code here
employees[(employees["Title"]=="associate")&(employees["Salary"]>55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [37]:
# your code here
employees.groupby("Years").agg({"Salary":"mean"})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [38]:
# your code here
employees.groupby("Title").agg({"Salary":"mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [42]:
# your code here
q1=np.quantile(employees["Salary"],0.25)
q2=np.quantile(employees["Salary"],0.50)
q3=np.quantile(employees["Salary"],0.75)

print(q1,q2,q3)

35.0 55.0 60.0

#### Is the mean salary different per gender?

In [47]:
# your code here
female_avgsalary=employees[employees["Gender"]=="F"]["Salary"].mean()
male_avgsalary=employees[employees["Gender"]=="M"]["Salary"].mean()

diff=female_avgsalary-male_avgsalary
diff

-2.5

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [49]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [53]:
# your code here
employees.groupby(["Years","Salary"]).agg({"Years":["min","max","mean"],"Salary":["min","max","mean"]})

             Years          Salary
               min max mean    min max  mean
Years Salary
1     35         1   1  1.0     35  35  35.0
2     30         2   2  2.0     30  30  30.0
      55         2   2  2.0     55  55  55.0
3     55         3   3  3.0     55  55  55.0
4     35         4   4  4.0     35  35  35.0
7     60         7   7  7.0     60  60  60.0
8     70         8   8  8.0     70  70  70.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [65]:
# your code here
diff=(lambda x: max(x)-min(x))
employees.groupby('Department').['Salary'].apply(diff)
#print(diff)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here